import React from 'react';
import { useParams } from 'react-router-dom';
import jobImage1 from '../Images/OIP.jpg';
import jobImage2 from '../Images/OIP.jpg';

const ITIjobDesc = () => {
  const { id } = useParams();


    const jobProfiles = [
      { 
        id: 1, 
        title: 'Software Engineer', 
        description: `
          कुल पद: 1
    
          पद का नाम: Software Engineer
    
          योग्यता: B.Tech, BCA
    
          आवेदन प्रक्रिया: ऑनलाइन लिंक के माध्यम से
    
          आयु सीमा: न्यूनतम 18 वर्ष और अधिकतम 35 वर्ष
    
          शुल्क: सभी वर्गों के लिए आवेदन निशुल्क है।
    
          आवेदन प्रक्रिया:
          - रजिस्ट्रेशन: आवेदन करने के लिए सबसे पहले रजिस्टर करें।
          - दस्तावेज़ अपलोड करें: 10वीं की मार्कशीट और अन्य आवश्यक दस्तावेज अपलोड करें।
    
          चयन प्रक्रिया:
          इस भर्ती में चयन परीक्षा के आधार पर किया जाएगा।
    
          वेतन: ₹20,000/माह
        `, 
        salary: '₹ 20,000/month', 
        qualification: 'B.Tech, BCA' ,
        image: jobImage1
      },
      { 
        id: 2, 
        title: 'Data Analyst', 
        description: `
          कुल पद: 1
    
          पद का नाम: Data Analyst
    
          योग्यता: BCA, MCA
    
          आवेदन प्रक्रिया: ऑनलाइन लिंक के माध्यम से
    
          आयु सीमा: न्यूनतम 18 वर्ष और अधिकतम 35 वर्ष
    
          शुल्क: सभी वर्गों के लिए आवेदन निशुल्क है।
    
          आवेदन प्रक्रिया:
          - रजिस्ट्रेशन: आवेदन करने के लिए सबसे पहले रजिस्टर करें।
          - दस्तावेज़ अपलोड करें: 10वीं की मार्कशीट और अन्य आवश्यक दस्तावेज अपलोड करें।
    
          चयन प्रक्रिया:
          इस भर्ती में चयन परीक्षा के आधार पर किया जाएगा।
    
          वेतन: ₹15,000/माह
        `, 
        salary: '₹ 15,000/month', 
        qualification: 'BCA, MCA' ,
        image: jobImage2
      },
      { 
        id: 3, 
        title: 'HR Coordinator', 
        description: `
          कुल पद: 1
    
          पद का नाम: HR Coordinator
    
          योग्यता: MBA, BCA
    
          आवेदन प्रक्रिया: ऑनलाइन लिंक के माध्यम से
    
          आयु सीमा: न्यूनतम 18 वर्ष और अधिकतम 35 वर्ष
    
          शुल्क: सभी वर्गों के लिए आवेदन निशुल्क है।
    
          आवेदन प्रक्रिया:
          - रजिस्ट्रेशन: आवेदन करने के लिए सबसे पहले रजिस्टर करें।
          - दस्तावेज़ अपलोड करें: 10वीं की मार्कशीट और अन्य आवश्यक दस्तावेज अपलोड करें।
    
          चयन प्रक्रिया:
          इस भर्ती में चयन परीक्षा के आधार पर किया जाएगा।
    
          वेतन: ₹18,000/माह
        `, 
        salary: '₹ 18,000/month', 
        qualification: 'MBA, BCA' 
      },
      { 
        id: 4, 
        title: 'Sales Executive', 
        description: `
          कुल पद: 1
    
          पद का नाम: Sales Executive
    
          योग्यता: 12th, Graduation
    
          आवेदन प्रक्रिया: ऑनलाइन लिंक के माध्यम से
    
          आयु सीमा: न्यूनतम 18 वर्ष और अधिकतम 35 वर्ष
    
          शुल्क: सभी वर्गों के लिए आवेदन निशुल्क है।
    
          आवेदन प्रक्रिया:
          - रजिस्ट्रेशन: आवेदन करने के लिए सबसे पहले रजिस्टर करें।
          - दस्तावेज़ अपलोड करें: 10वीं की मार्कशीट और अन्य आवश्यक दस्तावेज अपलोड करें।
    
          चयन प्रक्रिया:
          इस भर्ती में चयन परीक्षा के आधार पर किया जाएगा।
    
          वेतन: ₹12,000/माह
        `, 
        salary: '₹ 12,000/month', 
        qualification: '12th, Graduation' 
      },
      { 
        id: 5, 
        title: 'Marketing Specialist', 
        description: `
          कुल पद: 1
    
          पद का नाम: Marketing Specialist
    
          योग्यता: Graduation
    
          आवेदन प्रक्रिया: ऑनलाइन लिंक के माध्यम से
    
          आयु सीमा: न्यूनतम 18 वर्ष और अधिकतम 35 वर्ष
    
          शुल्क: सभी वर्गों के लिए आवेदन निशुल्क है।
    
          आवेदन प्रक्रिया:
          - रजिस्ट्रेशन: आवेदन करने के लिए सबसे पहले रजिस्टर करें।
          - दस्तावेज़ अपलोड करें: 10वीं की मार्कशीट और अन्य आवश्यक दस्तावेज अपलोड करें।
    
          चयन प्रक्रिया:
          इस भर्ती में चयन परीक्षा के आधार पर किया जाएगा।
    
          वेतन: ₹18,000/माह
        `, 
        salary: '₹ 18,000/month', 
        qualification: 'Graduation' 
      },
      { 
        id: 6, 
        title: 'BPO Executive', 
        description: `
          कुल पद: 1
    
          पद का नाम: BPO Executive
    
          योग्यता: 12th, Graduation
    
          आवेदन प्रक्रिया: ऑनलाइन लिंक के माध्यम से
    
          आयु सीमा: न्यूनतम 18 वर्ष और अधिकतम 35 वर्ष
    
          शुल्क: सभी वर्गों के लिए आवेदन निशुल्क है।
    
          आवेदन प्रक्रिया:
          - रजिस्ट्रेशन: आवेदन करने के लिए सबसे पहले रजिस्टर करें।
          - दस्तावेज़ अपलोड करें: 10वीं की मार्कशीट और अन्य आवश्यक दस्तावेज अपलोड करें।
    
          चयन प्रक्रिया:
          इस भर्ती में चयन परीक्षा के आधार पर किया जाएगा।
    
          वेतन: ₹12,000/माह
        `, 
        salary: '₹ 12,000/month', 
        qualification: '12th, Graduation' 
      },
      { 
        id: 7, 
        title: 'Product Manager', 
        description: `
          कुल पद: 1
    
          पद का नाम: Product Manager
    
          योग्यता: B.Tech, MBA
    
          आवेदन प्रक्रिया: ऑनलाइन लिंक के माध्यम से
    
          आयु सीमा: न्यूनतम 18 वर्ष और अधिकतम 35 वर्ष
    
          शुल्क: सभी वर्गों के लिए आवेदन निशुल्क है।
    
          आवेदन प्रक्रिया:
          - रजिस्ट्रेशन: आवेदन करने के लिए सबसे पहले रजिस्टर करें।
          - दस्तावेज़ अपलोड करें: 10वीं की मार्कशीट और अन्य आवश्यक दस्तावेज अपलोड करें।
    
          चयन प्रक्रिया:
          इस भर्ती में चयन परीक्षा के आधार पर किया जाएगा।
    
          वेतन: ₹25,000/माह
        `, 
        salary: '₹ 25,000/month', 
        qualification: 'B.Tech, MBA' 
      },
      { 
        id: 8, 
        title: 'Content Writer', 
        description: `
          कुल पद: 1
    
          पद का नाम: Content Writer
    
          योग्यता: Graduation
    
          आवेदन प्रक्रिया: ऑनलाइन लिंक के माध्यम से
    
          आयु सीमा: न्यूनतम 18 वर्ष और अधिकतम 35 वर्ष
    
          शुल्क: सभी वर्गों के लिए आवेदन निशुल्क है।
    
          आवेदन प्रक्रिया:
          - रजिस्ट्रेशन: आवेदन करने के लिए सबसे पहले रजिस्टर करें।
          - दस्तावेज़ अपलोड करें: 10वीं की मार्कशीट और अन्य आवश्यक दस्तावेज अपलोड करें।
    
          चयन प्रक्रिया:
          इस भर्ती में चयन परीक्षा के आधार पर किया जाएगा।
    
          वेतन: ₹15,000/माह
        `, 
        salary: '₹ 15,000/month', 
        qualification: 'Graduation' 
      },
      { 
        id: 9, 
        title: 'Web Developer', 
        description: `
          कुल पद: 1
    
          पद का नाम: Web Developer
    
          योग्यता: B.Tech, BCA
    
          आवेदन प्रक्रिया: ऑनलाइन लिंक के माध्यम से
    
          आयु सीमा: न्यूनतम 18 वर्ष और अधिकतम 35 वर्ष
    
          शुल्क: सभी वर्गों के लिए आवेदन निशुल्क है।
    
          आवेदन प्रक्रिया:
          - रजिस्ट्रेशन: आवेदन करने के लिए सबसे पहले रजिस्टर करें।
          - दस्तावेज़ अपलोड करें: 10वीं की मार्कशीट और अन्य आवश्यक दस्तावेज अपलोड करें।
    
          चयन प्रक्रिया:
          इस भर्ती में चयन परीक्षा के आधार पर किया जाएगा।
    
          वेतन: ₹22,000/माह
        `, 
        salary: '₹ 22,000/month', 
        qualification: 'B.Tech, BCA' 
      },
      { 
        id: 10, 
        title: 'Customer Support Executive', 
        description: `
          कुल पद: 1
    
          पद का नाम: Customer Support Executive
    
          योग्यता: 10th, 12th
    
          आवेदन प्रक्रिया: ऑनलाइन लिंक के माध्यम से
    
          आयु सीमा: न्यूनतम 18 वर्ष और अधिकतम 35 वर्ष
    
          शुल्क: सभी वर्गों के लिए आवेदन निशुल्क है।
    
          आवेदन प्रक्रिया:
          - रजिस्ट्रेशन: आवेदन करने के लिए सबसे पहले रजिस्टर करें।
          - दस्तावेज़ अपलोड करें: 10वीं की मार्कशीट और अन्य आवश्यक दस्तावेज अपलोड करें।
    
          चयन प्रक्रिया:
          इस भर्ती में चयन परीक्षा के आधार पर किया जाएगा।
    
          वेतन: ₹10,000/माह
        `, 
        salary: '₹ 10,000/month', 
        qualification: '10th, 12th' 
      }
    ];
  const job = jobProfiles.find((job) => job.id === parseInt(id));

  if (!job) {
    return <div>Job not found</div>;
  }

  return (
    <div className="container my-5">
      <h2 className="text-center text-primary mb-4">{job.title}</h2>

      <div className="card shadow-sm">
      <img
                src={job.image} // Render the unique image for each job
                alt={job.title}
                className="card-img-top"
                style={{ height: '400px', objectFit: 'cover' }}
              />
        <div className="card-body">
          <p style={{ whiteSpace: 'pre-line', marginBottom: '1rem', lineHeight: '1.6' }}>
            {job.description}
          </p>
          <div style={{ marginTop: '1rem', lineHeight: '1.8' }}>
            <p><strong>Salary:</strong> {job.salary}</p>
            <p><strong>Qualification:</strong> {job.qualification}</p>
          </div>
        </div>
      </div>
    </div>
  );
};

export default ITIjobDesc;
